symbolic-integration-1-transcendental-functions-3.org
* 3 Differential Fields
** 3.1 Derivations
*** Definition 3.1.1 DifferentialRing
#+BEGIN_SRC axiom
-- DifferentialRing == Ring with D
DifferentialRing has Ring
-- DifferentialRing ?has? D : % -> %
#+END_SRC

#+RESULTS:
: -> -- DifferentialRing == Ring with D
: -> DifferentialRing has Ring
:
:    true
:                                                                 Type: Boolean
: -> -- DifferentialRing ?has? D : % -> %
:

** 3.2 Differential Extensions
*** Definition 3.2.1 DifferentialExtension
** 3.3 Constants and Extensions
** 3.4 Monomial Extensions
** 3.5 The Canonical Representation
*** Example 3.5.1
#+BEGIN_EXAMPLE
TBD
#+END_EXAMPLE

** Exercises

* 4 The Order Function
** 4.1 Basic Properties
*** Example 4.1.1
#+BEGIN_EXAMPLE
TBD
#+END_EXAMPLE

** 4.2 Localizations
** 4.3 The Order at Infinity
** 4.4 Residues and the Rothstein-Trager Resultant
** Exercises

* 5 Integration of Transcendental Functions
** 5.1 Elementary and Liouvillian Extensions
** 5.2 Outline and Scope of the Integration Algorithm
*** Example 5.2.1
#+BEGIN_SRC axiom
integrate(log(x)*log(x+1)*log(2*x^2+2*x), x)
#+END_SRC

#+RESULTS:
: -> integrate(log(x)*log(x+1)*log(2*x^2+2*x), x)
:
:       x
:     ┌┐                           2
:     │   log(%A)log(%A + 1)log(2%A  + 2%A)d%A
:    └┘
:                                          Type: Union(Expression(Integer),...)
:

*** Example 5.2.2
#+BEGIN_SRC axiom
integrate(exp(2*x)+exp(x+log(x)/2), x)
#+END_SRC

#+RESULTS:
: -> integrate(exp(2*x)+exp(x+log(x)/2), x)
:
:            log(%A) + 2%A
:       x    ─────────────
:     ┌┐           2           2%A
:     │   (%e              + %e   )d%A
:    └┘
:                                          Type: Union(Expression(Integer),...)
:

** 5.3 The Hermite Reduction
