symbolic-integration-1-transcendental-functions-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-25 Thu 20:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3c09e35">1. 3 Differential Fields</a>
<ul>
<li><a href="#orga9f0440">1.1. 3.1 Derivations</a>
<ul>
<li><a href="#orgf7994bb">1.1.1. Definition 3.1.1 DifferentialRing</a></li>
</ul>
</li>
<li><a href="#org15dcf87">1.2. 3.2 Differential Extensions</a>
<ul>
<li><a href="#orgc21618d">1.2.1. Definition 3.2.1 DifferentialExtension</a></li>
</ul>
</li>
<li><a href="#org1c729ab">1.3. 3.3 Constants and Extensions</a></li>
<li><a href="#orgc098783">1.4. 3.4 Monomial Extensions</a></li>
<li><a href="#org7610936">1.5. 3.5 The Canonical Representation</a>
<ul>
<li><a href="#orgc8c9614">1.5.1. Example 3.5.1</a></li>
</ul>
</li>
<li><a href="#org0337cc8">1.6. Exercises</a></li>
</ul>
</li>
<li><a href="#org84b7f64">2. 4 The Order Function</a>
<ul>
<li><a href="#org8353af9">2.1. 4.1 Basic Properties</a>
<ul>
<li><a href="#org94632dc">2.1.1. Example 4.1.1</a></li>
</ul>
</li>
<li><a href="#orgf825cd6">2.2. 4.2 Localizations</a></li>
<li><a href="#org8154a1a">2.3. 4.3 The Order at Infinity</a></li>
<li><a href="#org241d2f2">2.4. 4.4 Residues and the Rothstein-Trager Resultant</a></li>
<li><a href="#orgf644af4">2.5. Exercises</a></li>
</ul>
</li>
<li><a href="#org140e695">3. 5 Integration of Transcendental Functions</a>
<ul>
<li><a href="#org7b907c6">3.1. 5.1 Elementary and Liouvillian Extensions</a></li>
<li><a href="#orge0a1e69">3.2. 5.2 Outline and Scope of the Integration Algorithm</a>
<ul>
<li><a href="#orgf59e13f">3.2.1. Example 5.2.1</a></li>
<li><a href="#org50445ac">3.2.2. Example 5.2.2</a></li>
</ul>
</li>
<li><a href="#org1363916">3.3. 5.3 The Hermite Reduction</a>
<ul>
<li><a href="#org7123a00">3.3.1. Example 5.3.1</a></li>
</ul>
</li>
<li><a href="#org70d8306">3.4. 5.4 The Polynomial Reduction</a>
<ul>
<li><a href="#orge3d25d4">3.4.1. Example 5.4.1</a></li>
</ul>
</li>
<li><a href="#org6ab55fd">3.5. 5.5 Liouville's Theorem</a></li>
<li><a href="#org5b672f0">3.6. 5.6 The Residue Criterion</a>
<ul>
<li><a href="#orgf336ba2">3.6.1. Example 5.6.1</a></li>
<li><a href="#orgbd7bd68">3.6.2. Example 5.6.2</a></li>
</ul>
</li>
<li><a href="#orgec030b3">3.7. 5.7 Integration of Reduced Functions</a></li>
<li><a href="#org3f4e154">3.8. 5.8 The Primitive Case</a>
<ul>
<li><a href="#org23051da">3.8.1. Example 5.8.1</a></li>
</ul>
</li>
<li><a href="#org6117a45">3.9. 5.9 The Hyperexponential Case</a></li>
<li><a href="#orge61a9c6">3.10. 5.10 The Hypertangent Case</a>
<ul>
<li><a href="#orgd69cdd2">3.10.1. Example 5.10.1</a></li>
<li><a href="#org990a080">3.10.2. Example 5.10.2</a></li>
<li><a href="#orgd8f65f7">3.10.3. Example 5.10.3</a></li>
</ul>
</li>
<li><a href="#org50d8398">3.11. 5.11 The Nonlinear Case with no Specials</a>
<ul>
<li><a href="#org952b682">3.11.1. Example 5.11.1</a></li>
<li><a href="#orga8a0f55">3.11.2. Example 5.11.2</a></li>
</ul>
</li>
<li><a href="#orgd3bab37">3.12. 5.12 In-Field Integration</a></li>
<li><a href="#org260dc9c">3.13. Exercises</a>
<ul>
<li><a href="#orgc735e22">3.13.1. Exercise 5.6</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org065ddb9">4. 6 The Risch Differential Equation</a>
<ul>
<li><a href="#org36bb067">4.1. 6.1 The Normal Part of the Denominator</a>
<ul>
<li><a href="#org9122bee">4.1.1. Example 6.1.1</a></li>
<li><a href="#org238e166">4.1.2. Example 6.1.2</a></li>
</ul>
</li>
<li><a href="#org81ef2d6">4.2. 6.2 The Special Part of the Denominator</a>
<ul>
<li><a href="#org6f8d165">4.2.1. Example 6.2.1</a></li>
</ul>
</li>
<li><a href="#org203c147">4.3. 6.3 Degree Bounds</a>
<ul>
<li><a href="#orgc875325">4.3.1. Example 6.3.1</a></li>
<li><a href="#orgeb37efa">4.3.2. Example 6.3.2</a></li>
</ul>
</li>
<li><a href="#org437959f">4.4. 6.4 The SPDE Algorithm</a></li>
<li><a href="#org1dcf740">4.5. 6.5 The non-Cancellation Cases</a>
<ul>
<li><a href="#org777cb81">4.5.1. Example 6.5.1</a></li>
<li><a href="#orgdf9cd52">4.5.2. Example 6.5.3</a></li>
</ul>
</li>
<li><a href="#org1be1637">4.6. 6.6 The Cancellation Cases</a></li>
<li><a href="#orgea5ffbd">4.7. Exercises</a></li>
</ul>
</li>
<li><a href="#orga0934d9">5. 7 Parametric Problems</a>
<ul>
<li><a href="#orgd7e5aa7">5.1. 7.1 The Parametric Risch Differential Equation</a>
<ul>
<li><a href="#org8b4940c">5.1.1. Exercise 7.1.1</a></li>
<li><a href="#org035d214">5.1.2. Example 7.1.3</a></li>
<li><a href="#org69cd4fd">5.1.3. Example 7.1.4</a></li>
</ul>
</li>
<li><a href="#orgb3df4de">5.2. 7.2 The Limited Integration Problem</a>
<ul>
<li><a href="#org3b5384e">5.2.1. Example 7.2.1</a></li>
<li><a href="#orga8ee0a7">5.2.2. Example 7.3.1</a></li>
<li><a href="#org45b231a">5.2.3. Example 7.3.2</a></li>
</ul>
</li>
<li><a href="#org7e22f5b">5.3. Exercises</a></li>
</ul>
</li>
<li><a href="#org34ce626">6. 8 The Coupled Differential System</a>
<ul>
<li><a href="#org3ec72cc">6.1. 8.1 The Primitive Case</a></li>
<li><a href="#orgb40a380">6.2. 8.2 The Hyperexponential Case</a></li>
<li><a href="#org5c3630f">6.3. 8.3 The Nonlinear Case</a></li>
<li><a href="#org1ce015f">6.4. 8.4 The Hypertangent Case</a>
<ul>
<li><a href="#orgdcd8f33">6.4.1. Example 8.4.1</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org71e05f9">7. 9 Structure Theorems</a>
<ul>
<li><a href="#org1cced14">7.1. 9.1 the Module of Differentials</a></li>
<li><a href="#orgb61e595">7.2. 9.2 Rosenlicht's Theorem</a></li>
<li><a href="#orgb08ecf8">7.3. 9.3 The Risch Structure Theorems</a></li>
<li><a href="#org83636a5">7.4. 9.4 The Rothstein-Caviness Structure Theorem</a></li>
<li><a href="#orgdbac083">7.5. Exercises</a></li>
</ul>
</li>
<li><a href="#org17f27dc">8. 10 Parallel IntegrationResult</a>
<ul>
<li><a href="#orgfcf75d3">8.1. 10.1 Derivations of Polynomial Rings</a></li>
<li><a href="#org4359eda">8.2. 10.2 Structure of Elementary Antiderivatives</a></li>
<li><a href="#orgcd52282">8.3. 10.3 The Integration Method</a>
<ul>
<li><a href="#org7f68120">8.3.1. Example 10.3.1</a></li>
<li><a href="#orgfe9e6ae">8.3.2. Example 10.3.3</a></li>
<li><a href="#org9a92ef8">8.3.3. Example 10.3.4</a></li>
</ul>
</li>
<li><a href="#org1c5f358">8.4. 10.4 Simple Differential Fields</a></li>
</ul>
</li>
<li><a href="#orge8e2a17">9. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3c09e35" class="outline-2">
<h2 id="org3c09e35"><span class="section-number-2">1</span> 3 Differential Fields</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga9f0440" class="outline-3">
<h3 id="orga9f0440"><span class="section-number-3">1.1</span> 3.1 Derivations</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf7994bb" class="outline-4">
<h4 id="orgf7994bb"><span class="section-number-4">1.1.1</span> Definition 3.1.1 DifferentialRing</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-axiom"><span style="color: #2aa1ae; background-color: #292e34;">-- DifferentialRing == Ring with D</span>
<span style="color: #ce537a; font-weight: bold;">DifferentialRing</span> <span style="color: #4f97d7; font-weight: bold;">has</span> <span style="color: #ce537a; font-weight: bold;">Ring</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- DifferentialRing ?has? D : % -&gt; %</span>
</pre>
</div>

<pre class="example">
-&gt; -- DifferentialRing == Ring with D
-&gt; DifferentialRing has Ring

   true
                                                                Type: Boolean
-&gt; -- DifferentialRing ?has? D : % -&gt; %

</pre>
</div>
</div>
</div>

<div id="outline-container-org15dcf87" class="outline-3">
<h3 id="org15dcf87"><span class="section-number-3">1.2</span> 3.2 Differential Extensions</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc21618d" class="outline-4">
<h4 id="orgc21618d"><span class="section-number-4">1.2.1</span> Definition 3.2.1 DifferentialExtension</h4>
</div>
</div>
<div id="outline-container-org1c729ab" class="outline-3">
<h3 id="org1c729ab"><span class="section-number-3">1.3</span> 3.3 Constants and Extensions</h3>
</div>
<div id="outline-container-orgc098783" class="outline-3">
<h3 id="orgc098783"><span class="section-number-3">1.4</span> 3.4 Monomial Extensions</h3>
</div>
<div id="outline-container-org7610936" class="outline-3">
<h3 id="org7610936"><span class="section-number-3">1.5</span> 3.5 The Canonical Representation</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgc8c9614" class="outline-4">
<h4 id="orgc8c9614"><span class="section-number-4">1.5.1</span> Example 3.5.1</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example" id="orge3e47aa">
TBD
</pre>
</div>
</div>
</div>

<div id="outline-container-org0337cc8" class="outline-3">
<h3 id="org0337cc8"><span class="section-number-3">1.6</span> Exercises</h3>
</div>
</div>

<div id="outline-container-org84b7f64" class="outline-2">
<h2 id="org84b7f64"><span class="section-number-2">2</span> 4 The Order Function</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8353af9" class="outline-3">
<h3 id="org8353af9"><span class="section-number-3">2.1</span> 4.1 Basic Properties</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org94632dc" class="outline-4">
<h4 id="org94632dc"><span class="section-number-4">2.1.1</span> Example 4.1.1</h4>
<div class="outline-text-4" id="text-2-1-1">
<pre class="example" id="org4f24122">
TBD
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf825cd6" class="outline-3">
<h3 id="orgf825cd6"><span class="section-number-3">2.2</span> 4.2 Localizations</h3>
</div>
<div id="outline-container-org8154a1a" class="outline-3">
<h3 id="org8154a1a"><span class="section-number-3">2.3</span> 4.3 The Order at Infinity</h3>
</div>
<div id="outline-container-org241d2f2" class="outline-3">
<h3 id="org241d2f2"><span class="section-number-3">2.4</span> 4.4 Residues and the Rothstein-Trager Resultant</h3>
</div>
<div id="outline-container-orgf644af4" class="outline-3">
<h3 id="orgf644af4"><span class="section-number-3">2.5</span> Exercises</h3>
</div>
</div>

<div id="outline-container-org140e695" class="outline-2">
<h2 id="org140e695"><span class="section-number-2">3</span> 5 Integration of Transcendental Functions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7b907c6" class="outline-3">
<h3 id="org7b907c6"><span class="section-number-3">3.1</span> 5.1 Elementary and Liouvillian Extensions</h3>
</div>
<div id="outline-container-orge0a1e69" class="outline-3">
<h3 id="orge0a1e69"><span class="section-number-3">3.2</span> 5.2 Outline and Scope of the Integration Algorithm</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgf59e13f" class="outline-4">
<h4 id="orgf59e13f"><span class="section-number-4">3.2.1</span> Example 5.2.1</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>log<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>*log<span style="color: #bc6ec5;">(</span>x+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>*log<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">2</span>*x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(log(x)*log(x+1)*log(2*x^2+2*x), x)

      x
    ┌┐                           2
    │   log(%A)log(%A + 1)log(2%A  + 2%A)d%A
   └┘
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-org50445ac" class="outline-4">
<h4 id="org50445ac"><span class="section-number-4">3.2.2</span> Example 5.2.2</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>exp<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>*x<span style="color: #bc6ec5;">)</span>+exp<span style="color: #bc6ec5;">(</span>x+log<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span>/<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(exp(2*x)+exp(x+log(x)/2), x)

           log(%A) + 2%A
      x    ─────────────
    ┌┐           2           2%A
    │   (%e              + %e   )d%A
   └┘
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1363916" class="outline-3">
<h3 id="org1363916"><span class="section-number-3">3.3</span> 5.3 The Hermite Reduction</h3>
<div class="outline-text-3" id="text-3-3">
</div>
