symbolic-integration-1-transcendental-functions-3.org
*** Example 5.3.1
#+BEGIN_SRC axiom
integrate((x - tan(x))/(tan x)^2, x)
#+END_SRC

#+RESULTS:
: -> integrate((x - tan(x))/(tan x)^2, x)
:
:       2
:    - x tan(x) - 2x
:    ───────────────
:        2tan(x)
:                                          Type: Union(Expression(Integer),...)
:

** 5.4 The Polynomial Reduction
*** Example 5.4.1
#+BEGIN_SRC axiom
integrate(1+x*tan(x)+(tan x)^2, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate(1+x*tan(x)+(tan x)^2, x)
   dilog
                2
         2cos(x)          2cos(x)sin(x)
   [───────────────── + ───────────────── %i]
          2         2         2         2
    sin(x)  + cos(x)    sin(x)  + cos(x)

                      ┌───┐                       ┌───┐
                    2\│- 1                      2\│- 1
       - 2x log(───────────────) - 2x log(- ───────────────)
                          ┌───┐                       ┌───┐
                tan(x) + \│- 1              tan(x) - \│- 1
     +
                         ┌───┐                            ┌───┐
        ┌───┐          2\│- 1          ┌───┐            2\│- 1
       \│- 1 dilog(───────────────) - \│- 1 dilog(- ───────────────) + 4tan(x)
                             ┌───┐                            ┌───┐
                   tan(x) + \│- 1                   tan(x) - \│- 1
  /
     4
                                         Type: Union(Expression(Integer),...)

#+end_example

** 5.5 Liouville's Theorem
** 5.6 The Residue Criterion
*** Example 5.6.1
*** Example 5.6.2
#+BEGIN_SRC axiom
integrate((2*(log x)^2 - log x - x^2)/((log x)^3 - x^2 * log x), x)
#+END_SRC

#+RESULTS:
: -> integrate((2*(log x)^2 - log x - x^2)/((log x)^3 - x^2 * log x), x)
:
:    log(log(x) + x) - log(log(x) - x) + 2li(x)
:    ──────────────────────────────────────────
:                         2
:                                          Type: Union(Expression(Integer),...)
:

** 5.7 Integration of Reduced Functions
** 5.8 The Primitive Case
*** Example 5.8.1
#+BEGIN_SRC axiom
integrate((log(x) + 1/log(x))*li(x) - x/log(x), x)
#+END_SRC

#+RESULTS:
: -> integrate((log(x) + 1/log(x))*li(x) - x/log(x), x)
:
:                          2               2
:    2x li(x)log(x) + li(x)  - 2x li(x) - x
:    ───────────────────────────────────────
:                       2
:                                          Type: Union(Expression(Integer),...)
:

** 5.9 The Hyperexponential Case
#+BEGIN_SRC axiom
integrate(((tan x)^3 + (x+1)*(tan x)^2 + tan(x)+x+2)*exp tan x + 1/(x^2+1), x)
#+END_SRC

#+RESULTS:
: -> integrate(((tan x)^3 + (x+1)*(tan x)^2 + tan(x)+x+2)*exp tan x + 1/(x^2+1), x)
:
:                  tan(x)
:    (tan(x) + x)%e       + atan(x)
:                                          Type: Union(Expression(Integer),...)
:

** 5.10 The Hypertangent Case
*** Example 5.10.1
Same with Example 5.4.1.

*** Example 5.10.2
#+BEGIN_SRC axiom
integrate(sin(x)/x, x)
#+END_SRC

#+RESULTS:
: -> integrate(sin(x)/x, x)
:
:    Si(x)
:                                          Type: Union(Expression(Integer),...)
:

*** Example 5.10.3
#+BEGIN_SRC axiom
integrate(((tan x)^5 + (tan x)^3 + x^2*tan(x) + 1)/((tan x)^2 + 1)^3, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate(((tan x)^5 + (tan x)^3 + x^2*tan(x) + 1)/((tan x)^2 + 1)^3, x)

            2                     6                      5
       (360x  + 2160x + 835)tan(x)  + (720x + 2160)tan(x)
     +
             2                     4                       3
       (1080x  + 6480x - 591)tan(x)  + (1920x + 5760)tan(x)
     +
           2                      2                              2
     (1080x  + 6480x - 1839)tan(x)  + (1584x + 4752)tan(x) - 792x  + 2160x - 349
  /
               6              4              2
     6912tan(x)  + 20736tan(x)  + 20736tan(x)  + 6912
                                         Type: Union(Expression(Integer),...)

#+end_example

** 5.11 The Nonlinear Case with no Specials
*** Example 5.11.1
*** Example 5.11.2

** 5.12 In-Field Integration

** Exercises
*** Exercise 5.6
