symbolic-integration-1-transcendental-functions-3.html
<div id="outline-container-org7123a00" class="outline-4">
<h4 id="org7123a00"><span class="section-number-4">3.3.1</span> Example 5.3.1</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>x - tan<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>tan x<span style="color: #bc6ec5;">)</span>^<span style="color: #a45bad;">2</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((x - tan(x))/(tan x)^2, x)

      2
   - x tan(x) - 2x
   ───────────────
       2tan(x)
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org70d8306" class="outline-3">
<h3 id="org70d8306"><span class="section-number-3">3.4</span> 5.4 The Polynomial Reduction</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orge3d25d4" class="outline-4">
<h4 id="orge3d25d4"><span class="section-number-4">3.4.1</span> Example 5.4.1</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>+x*tan<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>+<span style="color: #bc6ec5;">(</span>tan x<span style="color: #bc6ec5;">)</span>^<span style="color: #a45bad;">2</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org8c7b562">
-&gt; integrate(1+x*tan(x)+(tan x)^2, x)
   dilog
                2
         2cos(x)          2cos(x)sin(x)
   [───────────────── + ───────────────── %i]
          2         2         2         2
    sin(x)  + cos(x)    sin(x)  + cos(x)

                      ┌───┐                       ┌───┐
                    2\│- 1                      2\│- 1
       - 2x log(───────────────) - 2x log(- ───────────────)
                          ┌───┐                       ┌───┐
                tan(x) + \│- 1              tan(x) - \│- 1
     +
                         ┌───┐                            ┌───┐
        ┌───┐          2\│- 1          ┌───┐            2\│- 1
       \│- 1 dilog(───────────────) - \│- 1 dilog(- ───────────────) + 4tan(x)
                             ┌───┐                            ┌───┐
                   tan(x) + \│- 1                   tan(x) - \│- 1
  /
     4
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org6ab55fd" class="outline-3">
<h3 id="org6ab55fd"><span class="section-number-3">3.5</span> 5.5 Liouville's Theorem</h3>
</div>
<div id="outline-container-org5b672f0" class="outline-3">
<h3 id="org5b672f0"><span class="section-number-3">3.6</span> 5.6 The Residue Criterion</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-orgf336ba2" class="outline-4">
<h4 id="orgf336ba2"><span class="section-number-4">3.6.1</span> Example 5.6.1</h4>
</div>
<div id="outline-container-orgbd7bd68" class="outline-4">
<h4 id="orgbd7bd68"><span class="section-number-4">3.6.2</span> Example 5.6.2</h4>
<div class="outline-text-4" id="text-3-6-2">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span> - log x - x^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span> - x^<span style="color: #a45bad;">2</span> * log x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((2*(log x)^2 - log x - x^2)/((log x)^3 - x^2 * log x), x)

   log(log(x) + x) - log(log(x) - x) + 2li(x)
   ──────────────────────────────────────────
                        2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgec030b3" class="outline-3">
<h3 id="orgec030b3"><span class="section-number-3">3.7</span> 5.7 Integration of Reduced Functions</h3>
</div>
<div id="outline-container-org3f4e154" class="outline-3">
<h3 id="org3f4e154"><span class="section-number-3">3.8</span> 5.8 The Primitive Case</h3>
<div class="outline-text-3" id="text-3-8">
</div>
<div id="outline-container-org23051da" class="outline-4">
<h4 id="org23051da"><span class="section-number-4">3.8.1</span> Example 5.8.1</h4>
<div class="outline-text-4" id="text-3-8-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>log<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> + <span style="color: #a45bad;">1</span>/log<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>*li<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span> - x/log<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((log(x) + 1/log(x))*li(x) - x/log(x), x)

                         2               2
   2x li(x)log(x) + li(x)  - 2x li(x) - x
   ───────────────────────────────────────
                      2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org6117a45" class="outline-3">
<h3 id="org6117a45"><span class="section-number-3">3.9</span> 5.9 The Hyperexponential Case</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span> + <span style="color: #2d9574;">(</span>x+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>*<span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span> + tan<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span>+x+<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>*exp tan x + <span style="color: #a45bad;">1</span>/<span style="color: #bc6ec5;">(</span>x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(((tan x)^3 + (x+1)*(tan x)^2 + tan(x)+x+2)*exp tan x + 1/(x^2+1), x)

                 tan(x)
   (tan(x) + x)%e       + atan(x)
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-orge61a9c6" class="outline-3">
<h3 id="orge61a9c6"><span class="section-number-3">3.10</span> 5.10 The Hypertangent Case</h3>
<div class="outline-text-3" id="text-3-10">
</div>
<div id="outline-container-orgd69cdd2" class="outline-4">
<h4 id="orgd69cdd2"><span class="section-number-4">3.10.1</span> Example 5.10.1</h4>
<div class="outline-text-4" id="text-3-10-1">
<p>
Same with Example 5.4.1.
</p>
</div>
</div>

<div id="outline-container-org990a080" class="outline-4">
<h4 id="org990a080"><span class="section-number-4">3.10.2</span> Example 5.10.2</h4>
<div class="outline-text-4" id="text-3-10-2">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>sin<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>/x, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(sin(x)/x, x)

   Si(x)
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-orgd8f65f7" class="outline-4">
<h4 id="orgd8f65f7"><span class="section-number-4">3.10.3</span> Example 5.10.3</h4>
<div class="outline-text-4" id="text-3-10-3">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">5</span> + <span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span> + x^<span style="color: #a45bad;">2</span>*tan<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> + <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span> + <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>^<span style="color: #a45bad;">3</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgdf506ea">
-&gt; integrate(((tan x)^5 + (tan x)^3 + x^2*tan(x) + 1)/((tan x)^2 + 1)^3, x)

            2                     6                      5
       (360x  + 2160x + 835)tan(x)  + (720x + 2160)tan(x)
     +
             2                     4                       3
       (1080x  + 6480x - 591)tan(x)  + (1920x + 5760)tan(x)
     +
           2                      2                              2
     (1080x  + 6480x - 1839)tan(x)  + (1584x + 4752)tan(x) - 792x  + 2160x - 349
  /
               6              4              2
     6912tan(x)  + 20736tan(x)  + 20736tan(x)  + 6912
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org50d8398" class="outline-3">
<h3 id="org50d8398"><span class="section-number-3">3.11</span> 5.11 The Nonlinear Case with no Specials</h3>
<div class="outline-text-3" id="text-3-11">
</div>
<div id="outline-container-org952b682" class="outline-4">
<h4 id="org952b682"><span class="section-number-4">3.11.1</span> Example 5.11.1</h4>
</div>
<div id="outline-container-orga8a0f55" class="outline-4">
<h4 id="orga8a0f55"><span class="section-number-4">3.11.2</span> Example 5.11.2</h4>
</div>
</div>

<div id="outline-container-orgd3bab37" class="outline-3">
<h3 id="orgd3bab37"><span class="section-number-3">3.12</span> 5.12 In-Field Integration</h3>
</div>
