symbolic-integration-1-transcendental-functions-3.org
**** a
#+BEGIN_SRC axiom
integrate((tan(a*x))^5, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate((tan(a*x))^5, x)

                1                  4            2
   - 2log(─────────────) + tan(a x)  - 2tan(a x)
                  2
          tan(a x)  + 1
   ──────────────────────────────────────────────
                         4a
                                         Type: Union(Expression(Integer),...)

#+end_example

**** b
#+BEGIN_SRC axiom
integrate(x^n*exp(x), x)
#+END_SRC

#+RESULTS:
: -> integrate(x^n*exp(x), x)
:
:       x
:     ┌┐    %A  n
:     │   %e  %A d%A
:    └┘
:                                          Type: Union(Expression(Integer),...)
:

**** c
#+BEGIN_SRC axiom
integrate(log(x+a)/(x+b), x)
#+END_SRC

#+RESULTS:
: -> integrate(log(x+a)/(x+b), x)
:
:       x
:     ┌┐  log(a + %A)
:     │   ─────────── d%A
:    └┘      b + %A
:                                          Type: Union(Expression(Integer),...)
:

**** d
#+BEGIN_SRC axiom
integrate(((x+1)*exp(x^2)+1)/((exp(x^2))^2-1), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate(((x+1)*exp(x^2)+1)/((exp(x^2))^2-1), x)

                    2
      x           %A
    ┌┐  (%A + 1)%e    + 1
    │   ───────────────── d%A
   └┘           2 2
              %A
           (%e   )  - 1
                                         Type: Union(Expression(Integer),...)

#+end_example

**** e
#+BEGIN_SRC axiom
integrate((1+x^(2-n)/(2-n)+(n-1)/x^n)*exp(x), x)
#+END_SRC

#+RESULTS:
: -> integrate((1+x^(2-n)/(2-n)+(n-1)/x^n)*exp(x), x)
:
:             x  n log(x)       2                x
:    (n - 2)%e %e         + (- x  + (- n + 2)x)%e
:    ─────────────────────────────────────────────
:                           n log(x)
:                  (n - 2)%e
:                                          Type: Union(Expression(Integer),...)
:

**** f
#+BEGIN_SRC axiom
integrate((2+(tan x)^2)/(1+(tan(x)+x)^2), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate((2+(tan x)^2)/(1+(tan(x)+x)^2), x)

                  2      2               3
          x tan(x)  + (2x  + 4)tan(x) + x  + 3x         x
   - atan(─────────────────────────────────────) + atan(─)
                        2                               2
                 2tan(x)  + 2x tan(x) - 2
   ───────────────────────────────────────────────────────
                              2
                                         Type: Union(Expression(Integer),...)

#+end_example

**** g
#+BEGIN_SRC axiom
integrate(((3*x-2)*(log x)^3+(x-1)*(log x)^2+2*x*(x-2)*log(x)+x^2)/(x*(log x)^6-4*x^2*(log x)^5+6*x^3*(log x)^4-4*x^4*(log x)^3+x^5*(log x)^2), x)
#+END_SRC

#+RESULTS:
: -> integrate(((3*x-2)*(log x)^3+(x-1)*(log x)^2+2*x*(x-2)*log(x)+x^2)/(x*(log x)^6-4*x^2*(log x)^5+6*x^3*(log x)^4-4*x^4*(log x)^3+x^5*(log x)^2), x)
:
:                       2
:                3log(x)  + log(x) + 3x
:    ──────────────────────────────────────────────
:           4            3     2      2     3
:    3log(x)  - 9x log(x)  + 9x log(x)  - 3x log(x)
:                                          Type: Union(Expression(Integer),...)
:

* 6 The Risch Differential Equation
** 6.1 The Normal Part of the Denominator
*** Example 6.1.1
#+BEGIN_SRC axiom
y := operator y
solve(D(y t,t)+y(t)=1/t, y, t)
#+END_SRC

#+RESULTS:
#+begin_example
-> y := operator y

   y
                                                          Type: BasicOperator
-> solve(D(y t,t)+y(t)=1/t, y, t)

                        - t            - t
   [particular = Ei(t)%e   ,basis = [%e   ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

