symbolic-integration-1-transcendental-functions-3.html

<div id="outline-container-org260dc9c" class="outline-3">
<h3 id="org260dc9c"><span class="section-number-3">3.13</span> Exercises</h3>
<div class="outline-text-3" id="text-3-13">
</div>
<div id="outline-container-orgc735e22" class="outline-4">
<h4 id="orgc735e22"><span class="section-number-4">3.13.1</span> Exercise 5.6</h4>
<div class="outline-text-4" id="text-3-13-1">
</div>
<ol class="org-ol">
<li><a id="org5af76d2"></a>a<br />
<div class="outline-text-5" id="text-3-13-1-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>tan<span style="color: #2d9574;">(</span>a*x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>^<span style="color: #a45bad;">5</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org65643cb">
-&gt; integrate((tan(a*x))^5, x)

                1                  4            2
   - 2log(─────────────) + tan(a x)  - 2tan(a x)
                  2
          tan(a x)  + 1
   ──────────────────────────────────────────────
                         4a
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="orgcf80313"></a>b<br />
<div class="outline-text-5" id="text-3-13-1-2">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>x^n*exp<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(x^n*exp(x), x)

      x
    ┌┐    %A  n
    │   %e  %A d%A
   └┘
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="org24ae2f2"></a>c<br />
<div class="outline-text-5" id="text-3-13-1-3">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>log<span style="color: #bc6ec5;">(</span>x+a<span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>x+b<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(log(x+a)/(x+b), x)

      x
    ┌┐  log(a + %A)
    │   ─────────── d%A
   └┘      b + %A
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="orgda1a4a4"></a>d<br />
<div class="outline-text-5" id="text-3-13-1-4">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>x+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>*exp<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>exp<span style="color: #67b11d;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgd7c6734">
-&gt; integrate(((x+1)*exp(x^2)+1)/((exp(x^2))^2-1), x)

                    2
      x           %A
    ┌┐  (%A + 1)%e    + 1
    │   ───────────────── d%A
   └┘           2 2
              %A
           (%e   )  - 1
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="orgb68c170"></a>e<br />
<div class="outline-text-5" id="text-3-13-1-5">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>+x^<span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span>-n<span style="color: #2d9574;">)</span>/<span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span>-n<span style="color: #2d9574;">)</span>+<span style="color: #2d9574;">(</span>n-<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>/x^n<span style="color: #bc6ec5;">)</span>*exp<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((1+x^(2-n)/(2-n)+(n-1)/x^n)*exp(x), x)

            x  n log(x)       2                x
   (n - 2)%e %e         + (- x  + (- n + 2)x)%e
   ─────────────────────────────────────────────
                          n log(x)
                 (n - 2)%e
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="org67721d0"></a>f<br />
<div class="outline-text-5" id="text-3-13-1-6">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>+<span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>+<span style="color: #2d9574;">(</span>tan<span style="color: #67b11d;">(</span>x<span style="color: #67b11d;">)</span>+x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org60344e3">
-&gt; integrate((2+(tan x)^2)/(1+(tan(x)+x)^2), x)

                  2      2               3
          x tan(x)  + (2x  + 4)tan(x) + x  + 3x         x
   - atan(─────────────────────────────────────) + atan(─)
                        2                               2
                 2tan(x)  + 2x tan(x) - 2
   ───────────────────────────────────────────────────────
                              2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>

<li><a id="orge8f6ed2"></a>g<br />
<div class="outline-text-5" id="text-3-13-1-7">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #a45bad;">3</span>*x-<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span>+<span style="color: #2d9574;">(</span>x-<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">2</span>*x*<span style="color: #2d9574;">(</span>x-<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>*log<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span>+x^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>x*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">6</span>-<span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">2</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">5</span>+<span style="color: #a45bad;">6</span>*x^<span style="color: #a45bad;">3</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">4</span>-<span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">4</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span>+x^<span style="color: #a45bad;">5</span>*<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(((3*x-2)*(log x)^3+(x-1)*(log x)^2+2*x*(x-2)*log(x)+x^2)/(x*(log x)^6-4*x^2*(log x)^5+6*x^3*(log x)^4-4*x^4*(log x)^3+x^5*(log x)^2), x)

                      2
               3log(x)  + log(x) + 3x
   ──────────────────────────────────────────────
          4            3     2      2     3
   3log(x)  - 9x log(x)  + 9x log(x)  - 3x log(x)
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org065ddb9" class="outline-2">
<h2 id="org065ddb9"><span class="section-number-2">4</span> 6 The Risch Differential Equation</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org36bb067" class="outline-3">
<h3 id="org36bb067"><span class="section-number-3">4.1</span> 6.1 The Normal Part of the Denominator</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org9122bee" class="outline-4">
<h4 id="org9122bee"><span class="section-number-4">4.1.1</span> Example 6.1.1</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-axiom">y := operator y
solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y t,t<span style="color: #bc6ec5;">)</span>+y<span style="color: #bc6ec5;">(</span>t<span style="color: #bc6ec5;">)</span>=<span style="color: #a45bad;">1</span>/t, y, t<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org58c2678">
-&gt; y := operator y

   y
                                                          Type: BasicOperator
-&gt; solve(D(y t,t)+y(t)=1/t, y, t)

                        - t            - t
   [particular = Ei(t)%e   ,basis = [%e   ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
