symbolic-integration-1-transcendental-functions-3.org
*** Example 6.1.2
#+BEGIN_SRC axiom
t := tan x
solve(D(y x,x) + (t^2+1)*y(x) = 1/t^2, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-> solve(D(y x,x) + (t^2+1)*y(x) = 1/t^2, y, x)
    Ei
   [
                             4cos(x)sin(x)
       ────────────────────────────────────────────────────────
             4           2           2         4          2
       sin(x)  + (2cos(x)  - 2)sin(x)  + cos(x)  + 2cos(x)  + 1
     +
                                2          2
                       - 2sin(x)  + 2cos(x)  + 2
       ──────────────────────────────────────────────────────── %i
             4           2           2         4          2
       sin(x)  + (2cos(x)  - 2)sin(x)  + cos(x)  + 2cos(x)  + 1
     ]

   [
       particular
     =
                                                       ┌───┐
                  ┌───┐                   ┌───┐       \│- 1
               - \│- 1 tan(x)Ei(tan(x) + \│- 1 ) + 2%e      tan(x)Ei(tan(x))
             +
                         ┌───┐ 2
                ┌───┐   \│- 1                      ┌───┐
               \│- 1 (%e      ) tan(x)Ei(tan(x) - \│- 1 )
          *
               - tan(x)
             %e
         +
                 ┌───┐
                \│- 1
           - 2%e
      /
             ┌───┐
            \│- 1
         2%e      tan(x)
     ,
               - tan(x)
    basis = [%e        ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

** 6.2 The Special Part of the Denominator
*** Example 6.2.1
#+BEGIN_SRC axiom
t := exp x
eq := (t^2+2*x*t+x^2)*D(y x,x)+((1+1/x^2)*t^2+(2*x-1+2/x)*t+x^2)*y(x)=t/x^2-1+2/x
solve(eq, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := exp x

     x
   %e
                                                    Type: Expression(Integer)
-> eq := (t^2+2*x*t+x^2)*D(y x,x)+((1+1/x^2)*t^2+(2*x-1+2/x)*t+x^2)*y(x)=t/x^2-1+2/x

           2   x 2     3  x    4  ,        2            x 2
         (x (%e )  + 2x %e  + x )y (x) + (x  + 1)y(x)(%e )

       +
            3    2            x    4
         (2x  - x  + 2x)y(x)%e  + x y(x)
    /
        2
       x
   =
       x    2
     %e  - x  + 2x
     ─────────────
            2
           x
                                          Type: Equation(Expression(Integer))
-> solve(eq, y, x)

                                    2       x    3
                                (- x  + 1)%e  - x
                                ──────────────────
                                        x    2
                  1                 x %e  + x
   [particular = ───,basis = [%e                  ]]
                   x
                 %e
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

** 6.3 Degree Bounds
*** Example 6.3.1
#+BEGIN_SRC axiom
t0 := exp(-1/x)
t := log x
eq := t^2*D(y x,x)-(t^2/x^2+1/x)*y(x)=(2*x-1)*t^4+(t0+x)/x*t^3-(t0+4*x^2)/2/x*t^2+x*t
solve(eq, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t0 := exp(-1/x)

       1
     - ─
       x
   %e
                                                    Type: Expression(Integer)
-> t := log x

   log(x)
                                                    Type: Expression(Integer)
-> eq := t^2*D(y x,x)-(t^2/x^2+1/x)*y(x)=(2*x-1)*t^4+(t0+x)/x*t^3-(t0+4*x^2)/2/x*t^2+x*t

      2      2 ,                2
     x log(x) y (x) - y(x)log(x)  - x y(x)

     ─────────────────────────────────────
                        2
                       x
   =
                                   1                       1
                                 - ─                     - ─
            2            4         x            3          x     2       2
         (4x  - 2x)log(x)  + (2%e    + 2x)log(x)  + (- %e    - 4x )log(x)
       +
           2
         2x log(x)
    /
       2x
                                          Type: Equation(Expression(Integer))
-> solve(eq, y, x)

                      1
                    - ─                                      - log(x) - x
                      x     2       2     2                  ────────────
                 (%e    + 2x )log(x)  - 2x log(x)              x log(x)
   [particular = ────────────────────────────────,basis = [%e            ]]
                                 2
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

*** Example 6.3.2
#+BEGIN_SRC axiom
solve(D(y x,x)-2*x*y(x)=1, y, x)
#+END_SRC

#+RESULTS:
: -> solve(D(y x,x)-2*x*y(x)=1, y, x)
:
:                           2
:                          x  ┌───┐             2
:                  erf(x)%e  \│%pi             x
:    [particular = ────────────────,basis = [%e  ]]
:                          2
: Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)
:

** 6.4 The SPDE Algorithm
** 6.5 The non-Cancellation Cases
