symbolic-integration-1-transcendental-functions-3.html

<div id="outline-container-org238e166" class="outline-4">
<h4 id="org238e166"><span class="section-number-4">4.1.2</span> Example 6.1.2</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-axiom">t := tan x
solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span> + <span style="color: #bc6ec5;">(</span>t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>*y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span> = <span style="color: #a45bad;">1</span>/t^<span style="color: #a45bad;">2</span>, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org0273d05">
-&gt; t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-&gt; solve(D(y x,x) + (t^2+1)*y(x) = 1/t^2, y, x)
    Ei
   [
                             4cos(x)sin(x)
       ────────────────────────────────────────────────────────
             4           2           2         4          2
       sin(x)  + (2cos(x)  - 2)sin(x)  + cos(x)  + 2cos(x)  + 1
     +
                                2          2
                       - 2sin(x)  + 2cos(x)  + 2
       ──────────────────────────────────────────────────────── %i
             4           2           2         4          2
       sin(x)  + (2cos(x)  - 2)sin(x)  + cos(x)  + 2cos(x)  + 1
     ]

   [
       particular
     =
                                                       ┌───┐
                  ┌───┐                   ┌───┐       \│- 1
               - \│- 1 tan(x)Ei(tan(x) + \│- 1 ) + 2%e      tan(x)Ei(tan(x))
             +
                         ┌───┐ 2
                ┌───┐   \│- 1                      ┌───┐
               \│- 1 (%e      ) tan(x)Ei(tan(x) - \│- 1 )
          *
               - tan(x)
             %e
         +
                 ┌───┐
                \│- 1
           - 2%e
      /
             ┌───┐
            \│- 1
         2%e      tan(x)
     ,
               - tan(x)
    basis = [%e        ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org81ef2d6" class="outline-3">
<h3 id="org81ef2d6"><span class="section-number-3">4.2</span> 6.2 The Special Part of the Denominator</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org6f8d165" class="outline-4">
<h4 id="org6f8d165"><span class="section-number-4">4.2.1</span> Example 6.2.1</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-axiom">t := exp x
eq := <span style="color: #4f97d7;">(</span>t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">2</span>*x*t+x^<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>*D<span style="color: #4f97d7;">(</span>y x,x<span style="color: #4f97d7;">)</span>+<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>+<span style="color: #a45bad;">1</span>/x^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>*t^<span style="color: #a45bad;">2</span>+<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>*x-<span style="color: #a45bad;">1</span>+<span style="color: #a45bad;">2</span>/x<span style="color: #bc6ec5;">)</span>*t+x^<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>*y<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>=t/x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span>+<span style="color: #a45bad;">2</span>/x
solve<span style="color: #4f97d7;">(</span>eq, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgef6fdfa">
-&gt; t := exp x

     x
   %e
                                                    Type: Expression(Integer)
-&gt; eq := (t^2+2*x*t+x^2)*D(y x,x)+((1+1/x^2)*t^2+(2*x-1+2/x)*t+x^2)*y(x)=t/x^2-1+2/x

           2   x 2     3  x    4  ,        2            x 2
         (x (%e )  + 2x %e  + x )y (x) + (x  + 1)y(x)(%e )

       +
            3    2            x    4
         (2x  - x  + 2x)y(x)%e  + x y(x)
    /
        2
       x
   =
       x    2
     %e  - x  + 2x
     ─────────────
            2
           x
                                          Type: Equation(Expression(Integer))
-&gt; solve(eq, y, x)

                                    2       x    3
                                (- x  + 1)%e  - x
                                ──────────────────
                                        x    2
                  1                 x %e  + x
   [particular = ───,basis = [%e                  ]]
                   x
                 %e
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org203c147" class="outline-3">
<h3 id="org203c147"><span class="section-number-3">4.3</span> 6.3 Degree Bounds</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgc875325" class="outline-4">
<h4 id="orgc875325"><span class="section-number-4">4.3.1</span> Example 6.3.1</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-axiom">t0 := exp<span style="color: #4f97d7;">(</span>-<span style="color: #a45bad;">1</span>/x<span style="color: #4f97d7;">)</span>
t := log x
eq := t^<span style="color: #a45bad;">2</span>*D<span style="color: #4f97d7;">(</span>y x,x<span style="color: #4f97d7;">)</span>-<span style="color: #4f97d7;">(</span>t^<span style="color: #a45bad;">2</span>/x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span>/x<span style="color: #4f97d7;">)</span>*y<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>=<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span>*x-<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>*t^<span style="color: #a45bad;">4</span>+<span style="color: #4f97d7;">(</span>t0+x<span style="color: #4f97d7;">)</span>/x*t^<span style="color: #a45bad;">3</span>-<span style="color: #4f97d7;">(</span>t0+<span style="color: #a45bad;">4</span>*x^<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>/<span style="color: #a45bad;">2</span>/x*t^<span style="color: #a45bad;">2</span>+x*t
solve<span style="color: #4f97d7;">(</span>eq, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orge9f57fd">
-&gt; t0 := exp(-1/x)

       1
     - ─
       x
   %e
                                                    Type: Expression(Integer)
-&gt; t := log x

   log(x)
                                                    Type: Expression(Integer)
-&gt; eq := t^2*D(y x,x)-(t^2/x^2+1/x)*y(x)=(2*x-1)*t^4+(t0+x)/x*t^3-(t0+4*x^2)/2/x*t^2+x*t

      2      2 ,                2
     x log(x) y (x) - y(x)log(x)  - x y(x)

     ─────────────────────────────────────
                        2
                       x
   =
                                   1                       1
                                 - ─                     - ─
            2            4         x            3          x     2       2
         (4x  - 2x)log(x)  + (2%e    + 2x)log(x)  + (- %e    - 4x )log(x)
       +
           2
         2x log(x)
    /
       2x
                                          Type: Equation(Expression(Integer))
-&gt; solve(eq, y, x)

                      1
                    - ─                                      - log(x) - x
                      x     2       2     2                  ────────────
                 (%e    + 2x )log(x)  - 2x log(x)              x log(x)
   [particular = ────────────────────────────────,basis = [%e            ]]
                                 2
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>

<div id="outline-container-orgeb37efa" class="outline-4">
<h4 id="orgeb37efa"><span class="section-number-4">4.3.2</span> Example 6.3.2</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-axiom">solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>-<span style="color: #a45bad;">2</span>*x*y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>=<span style="color: #a45bad;">1</span>, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; solve(D(y x,x)-2*x*y(x)=1, y, x)

                          2
                         x  ┌───┐             2
                 erf(x)%e  \│%pi             x
   [particular = ────────────────,basis = [%e  ]]
                         2
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org437959f" class="outline-3">
<h3 id="org437959f"><span class="section-number-3">4.4</span> 6.4 The SPDE Algorithm</h3>
</div>
<div id="outline-container-org1dcf740" class="outline-3">
<h3 id="org1dcf740"><span class="section-number-3">4.5</span> 6.5 The non-Cancellation Cases</h3>
<div class="outline-text-3" id="text-4-5">
</div>
