symbolic-integration-1-transcendental-functions-3.org
*** Example 6.5.1
#+BEGIN_SRC axiom
t := tan x
solve(D(y x,x)+(t^2+1)*y(x)=t^3+(x+1)*t^2+t+x+2, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-> solve(D(y x,x)+(t^2+1)*y(x)=t^3+(x+1)*t^2+t+x+2, y, x)

                                       - tan(x)
   [particular = tan(x) + x,basis = [%e        ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

*** Example 6.5.3
Answer is =c1/cos(x)/exp(x)-tan(x)*(2*x-tan(x))=

#+BEGIN_SRC axiom
t := tan x
solve(D(y x,x)+(1-t)*y(x)=t^3+t^2-2*x*t-2*x, y, x)
solve(D(y x,x)+(1-t)*y(x)=-2*(x+1)*t-2*x, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-> solve(D(y x,x)+(1-t)*y(x)=t^3+t^2-2*x*t-2*x, y, x)

   >> Error detected within library code:
   integrate: implementation incomplete (constant residues)

-> solve(D(y x,x)+(1-t)*y(x)=-2*(x+1)*t-2*x, y, x)

   >> Error detected within library code:
   integrate: implementation incomplete (constant residues)


#+end_example

#+BEGIN_SRC axiom
integrate(((tan x)^3+(tan x)^2-2*x*tan(x)-2*x)*exp(x-log(1+(tan x)^2)/2), x)
#+END_SRC

#+RESULTS:
: -> integrate(((tan x)^3+(tan x)^2-2*x*tan(x)-2*x)*exp(x-log(1+(tan x)^2)/2), x)
:
:                                       2
:                           - log(tan(x)  + 1) + 2x
:                           ───────────────────────
:           2                          2
:    (tan(x)  - 2x tan(x))%e
:                                          Type: Union(Expression(Integer),...)
:

** 6.6 The Cancellation Cases
** Exercises

* 7 Parametric Problems
** 7.1 The Parametric Risch Differential Equation
*** Exercise 7.1.1
#+BEGIN_SRC axiom
solve(D(y x,x)=c1*(2*t^3+3*t+1)/(t^2-1)+c2/(t-1)+c3/(t+1), y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> solve(D(y x,x)=c1*(2*t^3+3*t+1)/(t^2-1)+c2/(t-1)+c3/(t+1), y, x)

   [
       particular
     =
                               2
                         tan(x)  + 2tan(x) + 1
           (c3 + 2c1)log(─────────────────────)
                                    2
                              tan(x)  + 1
         +
                               2
                         tan(x)  - 2tan(x) + 1                 1
           (c2 + 3c1)log(─────────────────────) - 4c1 log(───────────)
                                    2                           2
                              tan(x)  + 1                 tan(x)  + 1
         +
           (2c3 - 2c2 - 2c1)x
      /
         4
     ,
    basis = [1]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

*** Example 7.1.3
#+BEGIN_SRC axiom
solve(D(y x,x)+y(x)=c1*x^N+c2, y, x)
#+END_SRC

#+RESULTS:
: -> solve(D(y x,x)+y(x)=c1*x^N+c2, y, x)
:
:                          x      N
:                    - x ┌┐  c1 %A  + c2                 - x
:    [particular = %e    │   ─────────── d%A ,basis = [%e   ]]
:                       └┘        - %A
:                               %e
: Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)
:

*** Example 7.1.4
#+BEGIN_SRC axiom
t := log x
solve(t*D(y x,x)-y(x)/x=c1*x-c2*x*t, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := log x

   log(x)
                                                    Type: Expression(Integer)
-> solve(t*D(y x,x)-y(x)/x=c1*x-c2*x*t, y, x)

                                 2              2
   [particular = (- c2 + 2c1)li(x )log(x) - c1 x ,basis = [log(x)]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

** 7.2 The Limited Integration Problem
*** Example 7.2.1
#+BEGIN_SRC axiom
t := log x
solve(x/t^2=D(y x,x)+c1*x/t, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := log x

   log(x)
                                                    Type: Expression(Integer)
-> solve(x/t^2=D(y x,x)+c1*x/t, y, x)

                               2           2
                 (- c1 + 2)li(x )log(x) - x
   [particular = ───────────────────────────,basis = [1]]
                            log(x)
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

#+end_example

