symbolic-integration-1-transcendental-functions-3.html
<div id="outline-container-org777cb81" class="outline-4">
<h4 id="org777cb81"><span class="section-number-4">4.5.1</span> Example 6.5.1</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-axiom">t := tan x
solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>+<span style="color: #bc6ec5;">(</span>t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>*y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>=t^<span style="color: #a45bad;">3</span>+<span style="color: #bc6ec5;">(</span>x+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>*t^<span style="color: #a45bad;">2</span>+t+x+<span style="color: #a45bad;">2</span>, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org0c60ed7">
-&gt; t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-&gt; solve(D(y x,x)+(t^2+1)*y(x)=t^3+(x+1)*t^2+t+x+2, y, x)

                                       - tan(x)
   [particular = tan(x) + x,basis = [%e        ]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>

<div id="outline-container-orgdf9cd52" class="outline-4">
<h4 id="orgdf9cd52"><span class="section-number-4">4.5.2</span> Example 6.5.3</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Answer is <code>c1/cos(x)/exp(x)-tan(x)*(2*x-tan(x))</code>
</p>

<div class="org-src-container">
<pre class="src src-axiom">t := tan x
solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>+<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>-t<span style="color: #bc6ec5;">)</span>*y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>=t^<span style="color: #a45bad;">3</span>+t^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">2</span>*x*t-<span style="color: #a45bad;">2</span>*x, y, x<span style="color: #4f97d7;">)</span>
solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>+<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>-t<span style="color: #bc6ec5;">)</span>*y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>=-<span style="color: #a45bad;">2</span>*<span style="color: #bc6ec5;">(</span>x+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>*t-<span style="color: #a45bad;">2</span>*x, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org3ac7b75">
-&gt; t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-&gt; solve(D(y x,x)+(1-t)*y(x)=t^3+t^2-2*x*t-2*x, y, x)

   &gt;&gt; Error detected within library code:
   integrate: implementation incomplete (constant residues)

-&gt; solve(D(y x,x)+(1-t)*y(x)=-2*(x+1)*t-2*x, y, x)

   &gt;&gt; Error detected within library code:
   integrate: implementation incomplete (constant residues)


</pre>

<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">3</span>+<span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">2</span>*x*tan<span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span>-<span style="color: #a45bad;">2</span>*x<span style="color: #bc6ec5;">)</span>*exp<span style="color: #bc6ec5;">(</span>x-log<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span>+<span style="color: #67b11d;">(</span>tan x<span style="color: #67b11d;">)</span>^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>/<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate(((tan x)^3+(tan x)^2-2*x*tan(x)-2*x)*exp(x-log(1+(tan x)^2)/2), x)

                                      2
                          - log(tan(x)  + 1) + 2x
                          ───────────────────────
          2                          2
   (tan(x)  - 2x tan(x))%e
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1be1637" class="outline-3">
<h3 id="org1be1637"><span class="section-number-3">4.6</span> 6.6 The Cancellation Cases</h3>
</div>
<div id="outline-container-orgea5ffbd" class="outline-3">
<h3 id="orgea5ffbd"><span class="section-number-3">4.7</span> Exercises</h3>
</div>
</div>

<div id="outline-container-orga0934d9" class="outline-2">
<h2 id="orga0934d9"><span class="section-number-2">5</span> 7 Parametric Problems</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd7e5aa7" class="outline-3">
<h3 id="orgd7e5aa7"><span class="section-number-3">5.1</span> 7.1 The Parametric Risch Differential Equation</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org8b4940c" class="outline-4">
<h4 id="org8b4940c"><span class="section-number-4">5.1.1</span> Exercise 7.1.1</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-axiom">solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>=c1*<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>*t^<span style="color: #a45bad;">3</span>+<span style="color: #a45bad;">3</span>*t+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>t^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>+c2/<span style="color: #bc6ec5;">(</span>t-<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>+c3/<span style="color: #bc6ec5;">(</span>t+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org90a135a">
-&gt; solve(D(y x,x)=c1*(2*t^3+3*t+1)/(t^2-1)+c2/(t-1)+c3/(t+1), y, x)

   [
       particular
     =
                               2
                         tan(x)  + 2tan(x) + 1
           (c3 + 2c1)log(─────────────────────)
                                    2
                              tan(x)  + 1
         +
                               2
                         tan(x)  - 2tan(x) + 1                 1
           (c2 + 3c1)log(─────────────────────) - 4c1 log(───────────)
                                    2                           2
                              tan(x)  + 1                 tan(x)  + 1
         +
           (2c3 - 2c2 - 2c1)x
      /
         4
     ,
    basis = [1]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>

<div id="outline-container-org035d214" class="outline-4">
<h4 id="org035d214"><span class="section-number-4">5.1.2</span> Example 7.1.3</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-axiom">solve<span style="color: #4f97d7;">(</span>D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>+y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>=c1*x^N+c2, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; solve(D(y x,x)+y(x)=c1*x^N+c2, y, x)

                         x      N
                   - x ┌┐  c1 %A  + c2                 - x
   [particular = %e    │   ─────────── d%A ,basis = [%e   ]]
                      └┘        - %A
                              %e
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>

<div id="outline-container-org69cd4fd" class="outline-4">
<h4 id="org69cd4fd"><span class="section-number-4">5.1.3</span> Example 7.1.4</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-axiom">t := log x
solve<span style="color: #4f97d7;">(</span>t*D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>-y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>/x=c1*x-c2*x*t, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org1856f2b">
-&gt; t := log x

   log(x)
                                                    Type: Expression(Integer)
-&gt; solve(t*D(y x,x)-y(x)/x=c1*x-c2*x*t, y, x)

                                 2              2
   [particular = (- c2 + 2c1)li(x )log(x) - c1 x ,basis = [log(x)]]
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3df4de" class="outline-3">
<h3 id="orgb3df4de"><span class="section-number-3">5.2</span> 7.2 The Limited Integration Problem</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org3b5384e" class="outline-4">
<h4 id="org3b5384e"><span class="section-number-4">5.2.1</span> Example 7.2.1</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-axiom">t := log x
solve<span style="color: #4f97d7;">(</span>x/t^<span style="color: #a45bad;">2</span>=D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>+c1*x/t, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org97e125d">
-&gt; t := log x

   log(x)
                                                    Type: Expression(Integer)
-&gt; solve(x/t^2=D(y x,x)+c1*x/t, y, x)

                               2           2
                 (- c1 + 2)li(x )log(x) - x
   [particular = ───────────────────────────,basis = [1]]
                            log(x)
Type: Union(Record(particular: Expression(Integer),basis: List(Expression(Integer))),...)

</pre>
</div>
</div>
