symbolic-integration-1-transcendental-functions-3.org
*** Example 7.3.1
#+BEGIN_SRC axiom
t := log x
theta := exp(1/log(x))
eq := n*(5*t^2+t-6)/2/x/t^2 = D(y x,x)/y(x) + m*D(theta,x)/theta
solve(eq, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := log x

   log(x)
                                                    Type: Expression(Integer)
-> theta := exp(1/log(x))

        1
     ──────
     log(x)
   %e
                                                    Type: Expression(Integer)
-> eq := n*(5*t^2+t-6)/2/x/t^2 = D(y x,x)/y(x) + m*D(theta,x)/theta

                                        2 ,
            2                   x log(x) y (x) - m y(x)
   5n log(x)  + n log(x) - 6n
   ────────────────────────── = ───────────────────────
                    2                            2
           2x log(x)                 x y(x)log(x)
                                          Type: Equation(Expression(Integer))
-> solve(eq, y, x)

                                             2
            - n log(x)log(log(x)) - 5n log(x)  - 6n + 2m
            ────────────────────────────────────────────
                               2log(x)
   - 2y(x)%e
                                         Type: Union(Expression(Integer),...)

#+end_example

*** Example 7.3.2
#+BEGIN_SRC axiom
theta := exp x
solve(11=D(y x,x)/y(x)+m*D(theta,x)/theta, y, x)
#+END_SRC

#+RESULTS:
#+begin_example
-> theta := exp x

     x
   %e
                                                    Type: Expression(Integer)
-> solve(11=D(y x,x)/y(x)+m*D(theta,x)/theta, y, x)

           (m - 11)x
   - y(x)%e
                                         Type: Union(Expression(Integer),...)

#+end_example

#+BEGIN_SRC axiom
t := exp x
integrate((2581284541*t+1757211400)/(39916800*t^3+119750400*t^2+119750400*t+39916800)*exp(1/(t+1)-10*x),x)
#+END_SRC

#+RESULTS:
#+begin_example
-> t := exp x

     x
   %e
                                                    Type: Expression(Integer)
-> integrate((2581284541*t+1757211400)/(39916800*t^3+119750400*t^2+119750400*t+39916800)*exp(1/(t+1)-10*x),x)

                    x 11              x 9              x 8              x 7
         39916800(%e )   + 19958400(%e )  - 26611200(%e )  + 34927200(%e )
       +
                      x 6              x 5              x 4              x 3
         - 45239040(%e )  + 57934800(%e )  - 73465920(%e )  + 92356110(%e )
       +
                       x 2              x
         - 115211360(%e )  + 142731171%e  - 175721140
    *
                 x
         - 10x %e  - 10x + 1
         ───────────────────
                 x
               %e  + 1
       %e
  /
               x
     39916800%e  + 39916800
                                         Type: Union(Expression(Integer),...)

#+end_example

** Exercises

* 8 The Coupled Differential System
** 8.1 The Primitive Case
** 8.2 The Hyperexponential Case
** 8.3 The Nonlinear Case
** 8.4 The Hypertangent Case
