symbolic-integration-1-transcendental-functions-3.html

<div id="outline-container-orga8ee0a7" class="outline-4">
<h4 id="orga8ee0a7"><span class="section-number-4">5.2.2</span> Example 7.3.1</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">
<pre class="src src-axiom">t := log x
theta := exp<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span>/log<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
eq := n*<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">5</span>*t^<span style="color: #a45bad;">2</span>+t-<span style="color: #a45bad;">6</span><span style="color: #4f97d7;">)</span>/<span style="color: #a45bad;">2</span>/x/t^<span style="color: #a45bad;">2</span> = D<span style="color: #4f97d7;">(</span>y x,x<span style="color: #4f97d7;">)</span>/y<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span> + m*D<span style="color: #4f97d7;">(</span>theta,x<span style="color: #4f97d7;">)</span>/theta
solve<span style="color: #4f97d7;">(</span>eq, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org4acae66">
-&gt; t := log x

   log(x)
                                                    Type: Expression(Integer)
-&gt; theta := exp(1/log(x))

        1
     ──────
     log(x)
   %e
                                                    Type: Expression(Integer)
-&gt; eq := n*(5*t^2+t-6)/2/x/t^2 = D(y x,x)/y(x) + m*D(theta,x)/theta

                                        2 ,
            2                   x log(x) y (x) - m y(x)
   5n log(x)  + n log(x) - 6n
   ────────────────────────── = ───────────────────────
                    2                            2
           2x log(x)                 x y(x)log(x)
                                          Type: Equation(Expression(Integer))
-&gt; solve(eq, y, x)

                                             2
            - n log(x)log(log(x)) - 5n log(x)  - 6n + 2m
            ────────────────────────────────────────────
                               2log(x)
   - 2y(x)%e
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-org45b231a" class="outline-4">
<h4 id="org45b231a"><span class="section-number-4">5.2.3</span> Example 7.3.2</h4>
<div class="outline-text-4" id="text-5-2-3">
<div class="org-src-container">
<pre class="src src-axiom">theta := exp x
solve<span style="color: #4f97d7;">(</span><span style="color: #a45bad;">11</span>=D<span style="color: #bc6ec5;">(</span>y x,x<span style="color: #bc6ec5;">)</span>/y<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span>+m*D<span style="color: #bc6ec5;">(</span>theta,x<span style="color: #bc6ec5;">)</span>/theta, y, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org5b696d8">
-&gt; theta := exp x

     x
   %e
                                                    Type: Expression(Integer)
-&gt; solve(11=D(y x,x)/y(x)+m*D(theta,x)/theta, y, x)

           (m - 11)x
   - y(x)%e
                                         Type: Union(Expression(Integer),...)

</pre>

<div class="org-src-container">
<pre class="src src-axiom">t := exp x
integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2581284541</span>*t+<span style="color: #a45bad;">1757211400</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">39916800</span>*t^<span style="color: #a45bad;">3</span>+<span style="color: #a45bad;">119750400</span>*t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">119750400</span>*t+<span style="color: #a45bad;">39916800</span><span style="color: #bc6ec5;">)</span>*exp<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>/<span style="color: #2d9574;">(</span>t+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>-<span style="color: #a45bad;">10</span>*x<span style="color: #bc6ec5;">)</span>,x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgfb36d90">
-&gt; t := exp x

     x
   %e
                                                    Type: Expression(Integer)
-&gt; integrate((2581284541*t+1757211400)/(39916800*t^3+119750400*t^2+119750400*t+39916800)*exp(1/(t+1)-10*x),x)

                    x 11              x 9              x 8              x 7
         39916800(%e )   + 19958400(%e )  - 26611200(%e )  + 34927200(%e )
       +
                      x 6              x 5              x 4              x 3
         - 45239040(%e )  + 57934800(%e )  - 73465920(%e )  + 92356110(%e )
       +
                       x 2              x
         - 115211360(%e )  + 142731171%e  - 175721140
    *
                 x
         - 10x %e  - 10x + 1
         ───────────────────
                 x
               %e  + 1
       %e
  /
               x
     39916800%e  + 39916800
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org7e22f5b" class="outline-3">
<h3 id="org7e22f5b"><span class="section-number-3">5.3</span> Exercises</h3>
</div>
</div>

<div id="outline-container-org34ce626" class="outline-2">
<h2 id="org34ce626"><span class="section-number-2">6</span> 8 The Coupled Differential System</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3ec72cc" class="outline-3">
<h3 id="org3ec72cc"><span class="section-number-3">6.1</span> 8.1 The Primitive Case</h3>
</div>
<div id="outline-container-orgb40a380" class="outline-3">
<h3 id="orgb40a380"><span class="section-number-3">6.2</span> 8.2 The Hyperexponential Case</h3>
</div>
<div id="outline-container-org5c3630f" class="outline-3">
<h3 id="org5c3630f"><span class="section-number-3">6.3</span> 8.3 The Nonlinear Case</h3>
</div>
<div id="outline-container-org1ce015f" class="outline-3">
<h3 id="org1ce015f"><span class="section-number-3">6.4</span> 8.4 The Hypertangent Case</h3>
<div class="outline-text-3" id="text-6-4">
</div>
