symbolic-integration-1-transcendental-functions-3.org
*** Example 8.4.1
#+BEGIN_SRC axiom
y1 := operator 'y1; y2 := operator 'y2;
t := tan x
eqs := matrix[[D(y1 x,x)],[D(y2 x,x)]] + matrix[[0, -4*x],[4*x, 0]]*matrix[[y1 x],[y2 x]] = matrix[[-(t^2-2*t+8*x^2-1)/(t^2+1)],[2*(1-2*x)/(t^2+1)]]
-- solve(column(lhs eqs - rhs eqs, 1), [y1,y2], x) -- result too long
#+END_SRC

#+RESULTS:
#+begin_example
-> y1 := operator 'y1; y2 := operator 'y2;

                                                          Type: BasicOperator
-> t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-> eqs := matrix[[D(y1 x,x)],[D(y2 x,x)]] + matrix[[0, -4*x],[4*x, 0]]*matrix[[y1 x],[y2 x]] = matrix[[-(t^2-2*t+8*x^2-1)/(t^2+1)],[2*(1-2*x)/(t^2+1)]]

                         ┌        2               2    ┐
   ┌  ,              ┐   │- tan(x)  + 2tan(x) - 8x  + 1│
   │y1 (x) - 4x y2(x)│   │─────────────────────────────│
   │                 │   │               2             │
   │                 │ = │         tan(x)  + 1         │
   │  ,              │   │                             │
   │y2 (x) + 4x y1(x)│   │           - 4x + 2          │
   └                 ┘   │         ───────────         │
                         │               2             │
                         └         tan(x)  + 1         ┘
                                  Type: Equation(Matrix(Expression(Integer)))
-> -- solve(column(lhs eqs - rhs eqs, 1), [y1,y2], x) -- result too long

#+end_example

#+BEGIN_SRC axiom
integrate(-(((tan x)^2-2*tan x+8*x^2-1)*tan(x^2)+4*x-2)/((tan x)^2+1)/(tan(x^2)^2+1), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate(-(((tan x)^2-2*tan x+8*x^2-1)*tan(x^2)+4*x-2)/((tan x)^2+1)/(tan(x^2)^2+1), x)

             2                2                        2               2 2
       ((- 2x  + 2x + 1)tan(x)  + (- 4x + 2)tan(x) - 2x  - 2x - 1)tan(x )
     +
                         2         2                2                        2
       (4tan(x) - 4)tan(x ) + (- 2x  + 2x + 1)tan(x)  + (- 4x + 2)tan(x) - 2x
     +
       6x - 1
  /
             2          2 2          2
     (4tan(x)  + 4)tan(x )  + 4tan(x)  + 4
                                         Type: Union(Expression(Integer),...)

#+end_example

* 9 Structure Theorems
** 9.1 the Module of Differentials
** 9.2 Rosenlicht's Theorem
** 9.3 The Risch Structure Theorems
** 9.4 The Rothstein-Caviness Structure Theorem
** Exercises
* 10 Parallel IntegrationResult
** 10.1 Derivations of Polynomial Rings
** 10.2 Structure of Elementary Antiderivatives
** 10.3 The Integration Method
*** Example 10.3.1
#+BEGIN_SRC axiom
integrate(((exp(x)-x^2+2*x)/((exp(x)+x)^2*x^2))*exp((x^2-1)/x+1/(exp(x)+x)), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate(((exp(x)-x^2+2*x)/((exp(x)+x)^2*x^2))*exp((x^2-1)/x+1/(exp(x)+x)), x)

       2       x    3
     (x  - 1)%e  + x
     ────────────────
            x    2
        x %e  + x
   %e
   ──────────────────
             x
           %e
                                         Type: Union(Expression(Integer),...)

#+end_example

*** Example 10.3.3
#+BEGIN_SRC axiom
integrate((1 - log x)/(x^2-(log x)^2), x)
#+END_SRC

#+RESULTS:
: -> integrate((1 - log x)/(x^2-(log x)^2), x)
:
:    log(log(x) + x) - log(log(x) - x)
:    ─────────────────────────────────
:                    2
:                                          Type: Union(Expression(Integer),...)
:

*** Example 10.3.4
#+BEGIN_SRC axiom
integrate((x^2+(x^2+2)*lambertW(x^2))/x/(1+lambertW(x^2))^2,x)
#+END_SRC

#+RESULTS:
: -> integrate((x^2+(x^2+2)*lambertW(x^2))/x/(1+lambertW(x^2))^2,x)
:
:               2               2          2
:    2lambertW(x )log(lambertW(x ) + 1) + x
:    ───────────────────────────────────────
:                            2
:                 2lambertW(x )
:                                          Type: Union(Expression(Integer),...)
:

** 10.4 Simple Differential Fields

