symbolic-integration-1-transcendental-functions-3.html
<div id="outline-container-orgdcd8f33" class="outline-4">
<h4 id="orgdcd8f33"><span class="section-number-4">6.4.1</span> Example 8.4.1</h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">
<pre class="src src-axiom">y1 := operator 'y1; y2 := operator 'y2;
t := tan x
eqs := matrix<span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span>D<span style="color: #2d9574;">(</span>y1 x,x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>,<span style="color: #bc6ec5;">[</span>D<span style="color: #2d9574;">(</span>y2 x,x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span> + matrix<span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">0</span>, -<span style="color: #a45bad;">4</span>*x<span style="color: #bc6ec5;">]</span>,<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">4</span>*x, <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span>*matrix<span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span>y1 x<span style="color: #bc6ec5;">]</span>,<span style="color: #bc6ec5;">[</span>y2 x<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span> = matrix<span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span>-<span style="color: #2d9574;">(</span>t^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">2</span>*t+<span style="color: #a45bad;">8</span>*x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>/<span style="color: #2d9574;">(</span>t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>,<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">2</span>*<span style="color: #2d9574;">(</span><span style="color: #a45bad;">1</span>-<span style="color: #a45bad;">2</span>*x<span style="color: #2d9574;">)</span>/<span style="color: #2d9574;">(</span>t^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- solve(column(lhs eqs - rhs eqs, 1), [y1,y2], x) -- result too long</span>
</pre>
</div>

<pre class="example" id="org9565d02">
-&gt; y1 := operator 'y1; y2 := operator 'y2;

                                                          Type: BasicOperator
-&gt; t := tan x

   tan(x)
                                                    Type: Expression(Integer)
-&gt; eqs := matrix[[D(y1 x,x)],[D(y2 x,x)]] + matrix[[0, -4*x],[4*x, 0]]*matrix[[y1 x],[y2 x]] = matrix[[-(t^2-2*t+8*x^2-1)/(t^2+1)],[2*(1-2*x)/(t^2+1)]]

                         ┌        2               2    ┐
   ┌  ,              ┐   │- tan(x)  + 2tan(x) - 8x  + 1│
   │y1 (x) - 4x y2(x)│   │─────────────────────────────│
   │                 │   │               2             │
   │                 │ = │         tan(x)  + 1         │
   │  ,              │   │                             │
   │y2 (x) + 4x y1(x)│   │           - 4x + 2          │
   └                 ┘   │         ───────────         │
                         │               2             │
                         └         tan(x)  + 1         ┘
                                  Type: Equation(Matrix(Expression(Integer)))
-&gt; -- solve(column(lhs eqs - rhs eqs, 1), [y1,y2], x) -- result too long

</pre>

<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span>-<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>tan x<span style="color: #67b11d;">)</span>^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">2</span>*tan x+<span style="color: #a45bad;">8</span>*x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>*tan<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>+<span style="color: #a45bad;">4</span>*x-<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>tan x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>tan<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgfaac323">
-&gt; integrate(-(((tan x)^2-2*tan x+8*x^2-1)*tan(x^2)+4*x-2)/((tan x)^2+1)/(tan(x^2)^2+1), x)

             2                2                        2               2 2
       ((- 2x  + 2x + 1)tan(x)  + (- 4x + 2)tan(x) - 2x  - 2x - 1)tan(x )
     +
                         2         2                2                        2
       (4tan(x) - 4)tan(x ) + (- 2x  + 2x + 1)tan(x)  + (- 4x + 2)tan(x) - 2x
     +
       6x - 1
  /
             2          2 2          2
     (4tan(x)  + 4)tan(x )  + 4tan(x)  + 4
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org71e05f9" class="outline-2">
<h2 id="org71e05f9"><span class="section-number-2">7</span> 9 Structure Theorems</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1cced14" class="outline-3">
<h3 id="org1cced14"><span class="section-number-3">7.1</span> 9.1 the Module of Differentials</h3>
</div>
<div id="outline-container-orgb61e595" class="outline-3">
<h3 id="orgb61e595"><span class="section-number-3">7.2</span> 9.2 Rosenlicht's Theorem</h3>
</div>
<div id="outline-container-orgb08ecf8" class="outline-3">
<h3 id="orgb08ecf8"><span class="section-number-3">7.3</span> 9.3 The Risch Structure Theorems</h3>
</div>
<div id="outline-container-org83636a5" class="outline-3">
<h3 id="org83636a5"><span class="section-number-3">7.4</span> 9.4 The Rothstein-Caviness Structure Theorem</h3>
</div>
<div id="outline-container-orgdbac083" class="outline-3">
<h3 id="orgdbac083"><span class="section-number-3">7.5</span> Exercises</h3>
</div>
</div>
<div id="outline-container-org17f27dc" class="outline-2">
<h2 id="org17f27dc"><span class="section-number-2">8</span> 10 Parallel IntegrationResult</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgfcf75d3" class="outline-3">
<h3 id="orgfcf75d3"><span class="section-number-3">8.1</span> 10.1 Derivations of Polynomial Rings</h3>
</div>
<div id="outline-container-org4359eda" class="outline-3">
<h3 id="org4359eda"><span class="section-number-3">8.2</span> 10.2 Structure of Elementary Antiderivatives</h3>
</div>
<div id="outline-container-orgcd52282" class="outline-3">
<h3 id="orgcd52282"><span class="section-number-3">8.3</span> 10.3 The Integration Method</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org7f68120" class="outline-4">
<h4 id="org7f68120"><span class="section-number-4">8.3.1</span> Example 10.3.1</h4>
<div class="outline-text-4" id="text-8-3-1">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>exp<span style="color: #67b11d;">(</span>x<span style="color: #67b11d;">)</span>-x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">2</span>*x<span style="color: #2d9574;">)</span>/<span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>exp<span style="color: #b1951d;">(</span>x<span style="color: #b1951d;">)</span>+x<span style="color: #67b11d;">)</span>^<span style="color: #a45bad;">2</span>*x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>*exp<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>/x+<span style="color: #a45bad;">1</span>/<span style="color: #2d9574;">(</span>exp<span style="color: #67b11d;">(</span>x<span style="color: #67b11d;">)</span>+x<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="orgaf8b011">
-&gt; integrate(((exp(x)-x^2+2*x)/((exp(x)+x)^2*x^2))*exp((x^2-1)/x+1/(exp(x)+x)), x)

       2       x    3
     (x  - 1)%e  + x
     ────────────────
            x    2
        x %e  + x
   %e
   ──────────────────
             x
           %e
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-orgfe9e6ae" class="outline-4">
<h4 id="orgfe9e6ae"><span class="section-number-4">8.3.2</span> Example 10.3.3</h4>
<div class="outline-text-4" id="text-8-3-2">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span> - log x<span style="color: #bc6ec5;">)</span>/<span style="color: #bc6ec5;">(</span>x^<span style="color: #a45bad;">2</span>-<span style="color: #2d9574;">(</span>log x<span style="color: #2d9574;">)</span>^<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((1 - log x)/(x^2-(log x)^2), x)

   log(log(x) + x) - log(log(x) - x)
   ─────────────────────────────────
                   2
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>

<div id="outline-container-org9a92ef8" class="outline-4">
<h4 id="org9a92ef8"><span class="section-number-4">8.3.3</span> Example 10.3.4</h4>
<div class="outline-text-4" id="text-8-3-3">
<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>x^<span style="color: #a45bad;">2</span>+<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span>+<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>*lambertW<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>/x/<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>+lambertW<span style="color: #2d9574;">(</span>x^<span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>^<span style="color: #a45bad;">2</span>,x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
-&gt; integrate((x^2+(x^2+2)*lambertW(x^2))/x/(1+lambertW(x^2))^2,x)

              2               2          2
   2lambertW(x )log(lambertW(x ) + 1) + x
   ───────────────────────────────────────
                           2
                2lambertW(x )
                                         Type: Union(Expression(Integer),...)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1c5f358" class="outline-3">
<h3 id="org1c5f358"><span class="section-number-3">8.4</span> 10.4 Simple Differential Fields</h3>
</div>
</div>
