symbolic-integration-1-transcendental-functions-3.org
* References
[19]
http://sites.mathdoc.fr/JMPA/feuilleter.php?id=JMPA_1864_2_9 http://sites.mathdoc.fr/JMPA/PDF/JMPA_1864_2_9_A23_0.pdf

#+BEGIN_SRC axiom
integrate((x+1/6)/sqrt(x^4+x^2+x+1/4), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate((x+1/6)/sqrt(x^4+x^2+x+1/4), x)

     log
                                     ┌──────────────────┐
             4     3     2           │  4     2               6     5      4
          (4x  - 4x  + 6x  - 2x + 1)\│4x  + 4x  + 4x + 1  + 8x  - 8x  + 16x
        +
              3     2
          - 4x  + 4x  + 2x
  /
     6
                                         Type: Union(Expression(Integer),...)

#+end_example

#+BEGIN_SRC axiom
integrate((x+B)/sqrt(x^4+5*x^3+3*x^2-x), x)
#+END_SRC

#+RESULTS:
#+begin_example
-> integrate((x+B)/sqrt(x^4+5*x^3+3*x^2-x), x)

      x
    ┌┐            B + %A
    │   ───────────────────────── d%A
   └┘    ┌──────────────────────┐
         │  4      3      2
        \│%A  + 5%A  + 3%A  - %A
                                         Type: Union(Expression(Integer),...)

#+end_example

#+BEGIN_EXAMPLE
est inexprimable en termes finis
#+END_EXAMPLE
