symbolic-integration-1-transcendental-functions-3.html

<div id="outline-container-orge8e2a17" class="outline-2">
<h2 id="orge8e2a17"><span class="section-number-2">9</span> References</h2>
<div class="outline-text-2" id="text-9">
<p>
[19]
<a href="http://sites.mathdoc.fr/JMPA/feuilleter.php?id=JMPA_1864_2_9">http://sites.mathdoc.fr/JMPA/feuilleter.php?id=JMPA_1864_2_9</a> <a href="http://sites.mathdoc.fr/JMPA/PDF/JMPA_1864_2_9_A23_0.pdf">http://sites.mathdoc.fr/JMPA/PDF/JMPA_1864_2_9_A23_0.pdf</a>
</p>

<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>x+<span style="color: #a45bad;">1</span>/<span style="color: #a45bad;">6</span><span style="color: #bc6ec5;">)</span>/sqrt<span style="color: #bc6ec5;">(</span>x^<span style="color: #a45bad;">4</span>+x^<span style="color: #a45bad;">2</span>+x+<span style="color: #a45bad;">1</span>/<span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org49e8e82">
-&gt; integrate((x+1/6)/sqrt(x^4+x^2+x+1/4), x)

     log
                                     ┌──────────────────┐
             4     3     2           │  4     2               6     5      4
          (4x  - 4x  + 6x  - 2x + 1)\│4x  + 4x  + 4x + 1  + 8x  - 8x  + 16x
        +
              3     2
          - 4x  + 4x  + 2x
  /
     6
                                         Type: Union(Expression(Integer),...)

</pre>

<div class="org-src-container">
<pre class="src src-axiom">integrate<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>x+B<span style="color: #bc6ec5;">)</span>/sqrt<span style="color: #bc6ec5;">(</span>x^<span style="color: #a45bad;">4</span>+<span style="color: #a45bad;">5</span>*x^<span style="color: #a45bad;">3</span>+<span style="color: #a45bad;">3</span>*x^<span style="color: #a45bad;">2</span>-x<span style="color: #bc6ec5;">)</span>, x<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example" id="org046dd32">
-&gt; integrate((x+B)/sqrt(x^4+5*x^3+3*x^2-x), x)

      x
    ┌┐            B + %A
    │   ───────────────────────── d%A
   └┘    ┌──────────────────────┐
         │  4      3      2
        \│%A  + 5%A  + 3%A  - %A
                                         Type: Union(Expression(Integer),...)

</pre>

<pre class="example" id="orga5a0406">
est inexprimable en termes finis
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-25 Thu 20:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>